//3. 计算公式：求π的值 
【问题描述】
已知可以用下列公式计算π的近似值。给定一个π的近似值e，编程利用下列公式求得最接近e并且小于e的近似值π，以及迭代次数n（大于等于1）。
π/2 = (2/1 x 2/3) x (4/3 x 4/5) x (6/5 x 6/7) x ...x [2n/(2n-1)x2n/(2n+1)]
【输入形式】
从控制台输入e( e大于2.6666667，小于3.1415926)的值。
【输出形式】
输出最接近e并且小于e的近似值π，以及迭代次数n（以一个空格分隔，并且输出π时要求小数点后保留7位有效数字）。
#include <stdio.h>
int main() {
  double e = O;
  scanf("%lf", &e);
  double pai_2 = 1.0;
  int n = 1;
  for (n=1;pai_2*2.0<e;n++) {
    pai_2*=((2.0*n)/(2.0*n- 1)*((2.0*n)/(2.0*n + 1));
  }
  n=n-1;                                                    
  pai_2/=((2.0*n)/(2.0*n-1))*((2.0*n)/(2.0*n+1));
  n=n-1;
  double pai = 2.0* pai_2;printf("%.71f %d\n", pai, n);
  return 0;
}
