//小鱼最近被要求参加一个数字游戏，要求它把看到的一串数字（长度不一定，最多100个，以 0 结束），记住了然后反着念出来（表示结束的数字 0 就不要念出来了）。
//这对小鱼的那点记忆力来说实在是太难了，你也不想想小鱼的整个脑袋才多大，其中一部分还是好吃的肉！所以请你帮小鱼编程解决这个问题。
#include<iostream>
using namespace std;
int main() {
  int a[110], n = 1, tmp = 0;
  do {                              //之前不怎么用do while结构，今天试一下。
    cin >> a[n];
    tmp = a[n];                    //由于逻辑是先输入了a[n]，n++了之后才判断while值!=0，所以新设一个tmp记录输入的值，再拿去比较，防止出现只输入了第n位，却比较了n+1位的情况。
    n++;                            //当然也可以比较a[n-1]的
  }  while(tmp != 0);
  n -= 2;                          //输入0后n++了一次，此时n在0的后一位，又由于0不能被输出，所以向前减两位
  while ( n >= 1) {
    cout << a[n] << " ";
    n--;
  }
  return 0;
}
    
