//题目：输出前n项斐波那契数列（在不套公式的前提下）
#include<iostream>
using namespace std;
int main() {
    long long ans = 2, n,a = 1, b = 1; //在n>=3时，a当做当前项的前两项f(i-2)，b当做前一项f(i-1)，输出的ans就是当项f(i)
    cin >> n;
    if (n == 1) {
        cout << 1;
    }
    if (n == 2) {
        cout << 1 << " " << 1;
    }
    if (n >= 3) {
        cout << 1 << " " << 1;
        for (int i = 3;i <= n; i++) {
            ans = a + b;         //根据定义，当前项就是前两项之和
            cout << " " << ans;     //先输出当前项，再滚动地更新它前一项和前2项的和
            a = b;                  //旧的前第2项改为旧的前第一项，上面在输出后，旧的前第一项就是新的前第二项了
            b = ans;                //旧的前第一项改为当项，就是新的前一项了
        }
    }
return 0;
}
//这是输出前n项的写法。如果改一下，只输出第n项的话，首先两个if判断处合并，if((n == 1)||(n == 2)) cout << 1;
//大于3后，for循环体，原来是先加，输出，再滚动更新，变后，cout答案要放在外面，循环体只有先加，再滚动更新。
