//洛谷P3397地毯
#include<iostream>
using namespace std;
int main() {
    int n = 0, m = 0, x1 = 0, x2 = 0, y1 = 0, y2 = 0;
    cin >> n >> m;
    int a[1005][1005] = {0};                  
    for (int i = 1; i <= m; i++) {
        cin >> x1 >> y1 >> x2 >> y2;
        for (int j = x1; j <= x2; j++) {                      //现在学到的标准方法是行循环嵌套列循环，询问之后知道行列的两种嵌套会有细微差别，但是在现在的学习阶段，在这道题上
            for (int k = y1; k <= y2; k++) {                  //体现不出来，等以后再回来发现。
                a[j][k]++;                                    //这里采用比较直接的方法，直接对储存了每个处于地毯范围内的格子的数组值+1。询问后，知道以后可以运用
            }                                                 //二位差分前缀的方法优化算法。这道题如果数据较大，用现在的这种方法有超时的风险。但今天先按下不表。
        }
    }
    for (int l = 1; l <= n; l++) {
        for (int o = 1; o <= n; o++) {
            cout << a[l][o] << " ";
            if (o == n) {
                cout << endl;
            }
        }
    }
    return 0;
}
